## Staging: system_status_static_site
**✅ &nbsp; Terraform Init:** `success`
**✅ &nbsp; Terraform Validate:** `success`
**✅ &nbsp; Terraform Format:** `success`
**✅ &nbsp; Terraform Plan:** `success`
**⚠️ &nbsp; Warning:** resources will be destroyed by this change!
```terraform
Plan: 3 to add, 0 to change, 11 to destroy
```

<details>
<summary>Show summary</summary>

| CHANGE |                                                                  NAME                                                                   |
|--------|-----------------------------------------------------------------------------------------------------------------------------------------|
| add    | `aws_acm_certificate.system_status_static_site_root_certificate`                                                                        |
|        | `aws_acm_certificate_validation.system_status_static_site[0]`                                                                           |
|        | `aws_route53_record.system_status_static_site[0]`                                                                                       |
| delete | `module.system_status_static_site.aws_acm_certificate.cloudfront[0]`                                                                    |
|        | `module.system_status_static_site.aws_acm_certificate_validation.cloudfront[0]`                                                         |
|        | `module.system_status_static_site.aws_cloudfront_distribution.simple_static_website`                                                    |
|        | `module.system_status_static_site.aws_cloudfront_origin_access_identity.simple_static_website`                                          |
|        | `module.system_status_static_site.aws_route53_record.cloudfront_alias`                                                                  |
|        | `module.system_status_static_site.aws_route53_record.cloudfront_certificate_validation[&quot;*.status.staging.notification.cdssandbox.xyz&quot;]` |
|        | `module.system_status_static_site.aws_route53_record.cloudfront_certificate_validation[&quot;status.staging.notification.cdssandbox.xyz&quot;]`   |
|        | `module.system_status_static_site.aws_s3_bucket.this`                                                                                   |
|        | `module.system_status_static_site.aws_s3_bucket_policy.oai_policy`                                                                      |
|        | `module.system_status_static_site.aws_s3_bucket_website_configuration.this`                                                             |
|        | `module.system_status_static_site.random_string.suffix`                                                                                 |


</details>


<details>
<summary>Show plan</summary>

```terraform
Resource actions are indicated with the following symbols:
  + create
  - destroy

Terraform will perform the following actions:

  # aws_acm_certificate.system_status_static_site_root_certificate will be created
  + resource "aws_acm_certificate" "system_status_static_site_root_certificate" {
      + arn                       = (known after apply)
      + domain_name               = "status.staging.notification.cdssandbox.xyz"
      + domain_validation_options = [
          + {
              + domain_name           = "status.staging.notification.cdssandbox.xyz"
              + resource_record_name  = (known after apply)
              + resource_record_type  = (known after apply)
              + resource_record_value = (known after apply)
            },
        ]
      + id                        = (known after apply)
      + key_algorithm             = (known after apply)
      + not_after                 = (known after apply)
      + not_before                = (known after apply)
      + pending_renewal           = (known after apply)
      + renewal_eligibility       = (known after apply)
      + renewal_summary           = (known after apply)
      + status                    = (known after apply)
      + subject_alternative_names = [
          + "status.staging.notification.cdssandbox.xyz",
        ]
      + tags                      = {
          + "CostCenter" = "notification-canada-ca-staging"
        }
      + tags_all                  = {
          + "CostCenter" = "notification-canada-ca-staging"
        }
      + type                      = (known after apply)
      + validation_emails         = (known after apply)
      + validation_method         = "DNS"
    }

  # aws_acm_certificate_validation.system_status_static_site[0] will be created
  + resource "aws_acm_certificate_validation" "system_status_static_site" {
      + certificate_arn         = (known after apply)
      + id                      = (known after apply)
      + validation_record_fqdns = (known after apply)
    }

  # aws_route53_record.system_status_static_site[0] will be created
  + resource "aws_route53_record" "system_status_static_site" {
      + allow_overwrite = true
      + fqdn            = (known after apply)
      + id              = (known after apply)
      + name            = (known after apply)
      + records         = (known after apply)
      + ttl             = 60
      + type            = (known after apply)
      + zone_id         = "/hostedzone/Z04028033PLSHVOO9ZJ1Z"
    }

  # module.system_status_static_site.aws_acm_certificate.cloudfront[0] will be destroyed
  # (because module.system_status_static_site is not in configuration)
  - resource "aws_acm_certificate" "cloudfront" {
      - arn                       = "arn:aws:acm:us-east-1:239043911459:certificate/f26fd89e-1596-41f7-9b98-8ff6f3fb2a62" -> null
      - domain_name               = "status.staging.notification.cdssandbox.xyz" -> null
      - domain_validation_options = [
          - {
              - domain_name           = "*.status.staging.notification.cdssandbox.xyz"
              - resource_record_name  = "_440d029c47fc1dfe910ea2610b495f24.status.staging.notification.cdssandbox.xyz."
              - resource_record_type  = "CNAME"
              - resource_record_value = "_2b263703fa6b736f742a52128f2261b7.mhbtsbpdnt.acm-validations.aws."
            },
          - {
              - domain_name           = "status.staging.notification.cdssandbox.xyz"
              - resource_record_name  = "_440d029c47fc1dfe910ea2610b495f24.status.staging.notification.cdssandbox.xyz."
              - resource_record_type  = "CNAME"
              - resource_record_value = "_2b263703fa6b736f742a52128f2261b7.mhbtsbpdnt.acm-validations.aws."
            },
        ] -> null
      - id                        = "arn:aws:acm:us-east-1:239043911459:certificate/f26fd89e-1596-41f7-9b98-8ff6f3fb2a62" -> null
      - key_algorithm             = "RSA_2048" -> null
      - not_after                 = "2025-02-01T23:59:59Z" -> null
      - not_before                = "2024-01-04T00:00:00Z" -> null
      - pending_renewal           = false -> null
      - renewal_eligibility       = "ELIGIBLE" -> null
      - renewal_summary           = [] -> null
      - status                    = "ISSUED" -> null
      - subject_alternative_names = [
          - "*.status.staging.notification.cdssandbox.xyz",
          - "status.staging.notification.cdssandbox.xyz",
        ] -> null
      - tags                      = {
          - "CostCentre" = "notification-canada-ca-staging"
          - "Terraform"  = "true"
        } -> null
      - tags_all                  = {
          - "CostCentre" = "notification-canada-ca-staging"
          - "Terraform"  = "true"
        } -> null
      - type                      = "AMAZON_ISSUED" -> null
      - validation_emails         = [] -> null
      - validation_method         = "DNS" -> null

      - options {
          - certificate_transparency_logging_preference = "ENABLED" -> null
        }
    }

  # module.system_status_static_site.aws_acm_certificate_validation.cloudfront[0] will be destroyed
  # (because module.system_status_static_site is not in configuration)
  - resource "aws_acm_certificate_validation" "cloudfront" {
      - certificate_arn         = "arn:aws:acm:us-east-1:239043911459:certificate/f26fd89e-1596-41f7-9b98-8ff6f3fb2a62" -> null
      - id                      = "2024-01-04 16:41:36.147 +0000 UTC" -> null
      - validation_record_fqdns = [
          - "_440d029c47fc1dfe910ea2610b495f24.status.staging.notification.cdssandbox.xyz",
        ] -> null
    }

  # module.system_status_static_site.aws_cloudfront_distribution.simple_static_website will be destroyed
  # (because module.system_status_static_site is not in configuration)
  - resource "aws_cloudfront_distribution" "simple_static_website" {
      - aliases                        = [
          - "status.staging.notification.cdssandbox.xyz",
        ] -> null
      - arn                            = "arn:aws:cloudfront::239043911459:distribution/E3DYPXD9HEEQR3" -> null
      - caller_reference               = "terraform-20240104164211918400000002" -> null
      - default_root_object            = "index.html" -> null
      - domain_name                    = "d18e312iey8vub.cloudfront.net" -> null
      - enabled                        = true -> null
      - etag                           = "E2JHBORPBUH0V9" -> null
      - hosted_zone_id                 = "Z2FDTNDATAQYW2" -> null
      - http_version                   = "http2" -> null
      - id                             = "E3DYPXD9HEEQR3" -> null
      - in_progress_validation_batches = 0 -> null
      - is_ipv6_enabled                = false -> null
      - last_modified_time             = "2024-01-08 15:48:42.577 +0000 UTC" -> null
      - price_class                    = "PriceClass_100" -> null
      - retain_on_delete               = false -> null
      - staging                        = false -> null
      - status                         = "Deployed" -> null
      - tags                           = {
          - "CostCentre" = "notification-canada-ca-staging"
          - "Terraform"  = "true"
        } -> null
      - tags_all                       = {
          - "CostCentre" = "notification-canada-ca-staging"
          - "Terraform"  = "true"
        } -> null
      - trusted_key_groups             = [
          - {
              - enabled = false
              - items   = []
            },
        ] -> null
      - trusted_signers                = [
          - {
              - enabled = false
              - items   = []
            },
        ] -> null
      - wait_for_deployment            = true -> null

      - default_cache_behavior {
          - allowed_methods        = [
              - "DELETE",
              - "GET",
              - "HEAD",
              - "OPTIONS",
              - "PATCH",
              - "POST",
              - "PUT",
            ] -> null
          - cached_methods         = [
              - "GET",
              - "HEAD",
            ] -> null
          - compress               = true -> null
          - default_ttl            = 86400 -> null
          - max_ttl                = 86400 -> null
          - min_ttl                = 0 -> null
          - smooth_streaming       = false -> null
          - target_origin_id       = "simple_static_website" -> null
          - trusted_key_groups     = [] -> null
          - trusted_signers        = [] -> null
          - viewer_protocol_policy = "redirect-to-https" -> null

          - forwarded_values {
              - headers                 = [] -> null
              - query_string            = true -> null
              - query_string_cache_keys = [] -> null

              - cookies {
                  - forward           = "none" -> null
                  - whitelisted_names = [] -> null
                }
            }
        }

      - origin {
          - connection_attempts = 3 -> null
          - connection_timeout  = 10 -> null
          - domain_name         = "notification-canada-ca-staging-system-status.s3.ca-central-1.amazonaws.com" -> null
          - origin_id           = "simple_static_website" -> null

          - s3_origin_config {
              - origin_access_identity = "origin-access-identity/cloudfront/E3CM2FK12XRD1E" -> null
            }
        }

      - restrictions {
          - geo_restriction {
              - locations        = [] -> null
              - restriction_type = "none" -> null
            }
        }

      - viewer_certificate {
          - acm_certificate_arn            = "arn:aws:acm:us-east-1:239043911459:certificate/f26fd89e-1596-41f7-9b98-8ff6f3fb2a62" -> null
          - cloudfront_default_certificate = false -> null
          - minimum_protocol_version       = "TLSv1.2_2021" -> null
          - ssl_support_method             = "sni-only" -> null
        }
    }

  # module.system_status_static_site.aws_cloudfront_origin_access_identity.simple_static_website will be destroyed
  # (because module.system_status_static_site is not in configuration)
  - resource "aws_cloudfront_origin_access_identity" "simple_static_website" {
      - caller_reference                = "terraform-20240104164120435200000001" -> null
      - cloudfront_access_identity_path = "origin-access-identity/cloudfront/E3CM2FK12XRD1E" -> null
      - comment                         = "Allow CloudFront to reach the S3 bucket for domain status.staging.notification.cdssandbox.xyz" -> null
      - etag                            = "EN89829FOUGZQ" -> null
      - iam_arn                         = "arn:aws:iam::cloudfront:user/CloudFront Origin Access Identity E3CM2FK12XRD1E" -> null
      - id                              = "E3CM2FK12XRD1E" -> null
      - s3_canonical_user_id            = "6c766f2544539d34d195b339566c4ef6a0bb2210f54cf89e141f970aa2c4d93e514585309b162102e9fb7a2233e44ddc" -> null
    }

  # module.system_status_static_site.aws_route53_record.cloudfront_alias will be destroyed
  # (because module.system_status_static_site is not in configuration)
  - resource "aws_route53_record" "cloudfront_alias" {
      - fqdn                             = "status.staging.notification.cdssandbox.xyz" -> null
      - id                               = "Z04028033PLSHVOO9ZJ1Z_status.staging.notification.cdssandbox.xyz_A" -> null
      - multivalue_answer_routing_policy = false -> null
      - name                             = "status.staging.notification.cdssandbox.xyz" -> null
      - records                          = [] -> null
      - ttl                              = 0 -> null
      - type                             = "A" -> null
      - zone_id                          = "/hostedzone/Z04028033PLSHVOO9ZJ1Z" -> null

      - alias {
          - evaluate_target_health = false -> null
          - name                   = "d18e312iey8vub.cloudfront.net" -> null
          - zone_id                = "Z2FDTNDATAQYW2" -> null
        }
    }

  # module.system_status_static_site.aws_route53_record.cloudfront_certificate_validation["*.status.staging.notification.cdssandbox.xyz"] will be destroyed
  # (because module.system_status_static_site is not in configuration)
  - resource "aws_route53_record" "cloudfront_certificate_validation" {
      - allow_overwrite                  = true -> null
      - fqdn                             = "_440d029c47fc1dfe910ea2610b495f24.status.staging.notification.cdssandbox.xyz" -> null
      - id                               = "Z04028033PLSHVOO9ZJ1Z__440d029c47fc1dfe910ea2610b495f24.status.staging.notification.cdssandbox.xyz._CNAME" -> null
      - multivalue_answer_routing_policy = false -> null
      - name                             = "_440d029c47fc1dfe910ea2610b495f24.status.staging.notification.cdssandbox.xyz" -> null
      - records                          = [
          - "_2b263703fa6b736f742a52128f2261b7.mhbtsbpdnt.acm-validations.aws.",
        ] -> null
      - ttl                              = 60 -> null
      - type                             = "CNAME" -> null
      - zone_id                          = "/hostedzone/Z04028033PLSHVOO9ZJ1Z" -> null
    }

  # module.system_status_static_site.aws_route53_record.cloudfront_certificate_validation["status.staging.notification.cdssandbox.xyz"] will be destroyed
  # (because module.system_status_static_site is not in configuration)
  - resource "aws_route53_record" "cloudfront_certificate_validation" {
      - allow_overwrite                  = true -> null
      - fqdn                             = "_440d029c47fc1dfe910ea2610b495f24.status.staging.notification.cdssandbox.xyz" -> null
      - id                               = "Z04028033PLSHVOO9ZJ1Z__440d029c47fc1dfe910ea2610b495f24.status.staging.notification.cdssandbox.xyz._CNAME" -> null
      - multivalue_answer_routing_policy = false -> null
      - name                             = "_440d029c47fc1dfe910ea2610b495f24.status.staging.notification.cdssandbox.xyz" -> null
      - records                          = [
          - "_2b263703fa6b736f742a52128f2261b7.mhbtsbpdnt.acm-validations.aws.",
        ] -> null
      - ttl                              = 60 -> null
      - type                             = "CNAME" -> null
      - zone_id                          = "/hostedzone/Z04028033PLSHVOO9ZJ1Z" -> null
    }

  # module.system_status_static_site.aws_s3_bucket.this will be destroyed
  # (because module.system_status_static_site is not in configuration)
  - resource "aws_s3_bucket" "this" {
      - arn                         = "arn:aws:s3:::notification-canada-ca-staging-system-status" -> null
      - bucket                      = "notification-canada-ca-staging-system-status" -> null
      - bucket_domain_name          = "notification-canada-ca-staging-system-status.s3.amazonaws.com" -> null
      - bucket_regional_domain_name = "notification-canada-ca-staging-system-status.s3.ca-central-1.amazonaws.com" -> null
      - force_destroy               = false -> null
      - hosted_zone_id              = "Z1QDHH18159H29" -> null
      - id                          = "notification-canada-ca-staging-system-status" -> null
      - object_lock_enabled         = false -> null
      - policy                      = jsonencode(
            {
              - Statement = [
                  - {
                      - Action    = "s3:GetObject"
                      - Effect    = "Allow"
                      - Principal = {
                          - AWS = "arn:aws:iam::cloudfront:user/CloudFront Origin Access Identity E3CM2FK12XRD1E"
                        }
                      - Resource  = "arn:aws:s3:::notification-canada-ca-staging-system-status/*"
                    },
                ]
              - Version   = "2012-10-17"
            }
        ) -> null
      - region                      = "ca-central-1" -> null
      - request_payer               = "BucketOwner" -> null
      - tags                        = {} -> null
      - tags_all                    = {} -> null
      - website_domain              = "s3-website.ca-central-1.amazonaws.com" -> null
      - website_endpoint            = "notification-canada-ca-staging-system-status.s3-website.ca-central-1.amazonaws.com" -> null

      - grant {
          - id          = "69e55cefe4e71d4930761796ca1b0184cad872eb794dd25fbfc366b4501a75f9" -> null
          - permissions = [
              - "FULL_CONTROL",
            ] -> null
          - type        = "CanonicalUser" -> null
        }

      - server_side_encryption_configuration {
          - rule {
              - bucket_key_enabled = false -> null

              - apply_server_side_encryption_by_default {
                  - sse_algorithm = "AES256" -> null
                }
            }
        }

      - versioning {
          - enabled    = false -> null
          - mfa_delete = false -> null
        }

      - website {
          - error_document = "error.html" -> null
          - index_document = "index.html" -> null
        }
    }

  # module.system_status_static_site.aws_s3_bucket_policy.oai_policy will be destroyed
  # (because module.system_status_static_site is not in configuration)
  - resource "aws_s3_bucket_policy" "oai_policy" {
      - bucket = "notification-canada-ca-staging-system-status" -> null
      - id     = "notification-canada-ca-staging-system-status" -> null
      - policy = jsonencode(
            {
              - Statement = [
                  - {
                      - Action    = "s3:GetObject"
                      - Effect    = "Allow"
                      - Principal = {
                          - AWS = "arn:aws:iam::cloudfront:user/CloudFront Origin Access Identity E3CM2FK12XRD1E"
                        }
                      - Resource  = "arn:aws:s3:::notification-canada-ca-staging-system-status/*"
                    },
                ]
              - Version   = "2012-10-17"
            }
        ) -> null
    }

  # module.system_status_static_site.aws_s3_bucket_website_configuration.this will be destroyed
  # (because module.system_status_static_site is not in configuration)
  - resource "aws_s3_bucket_website_configuration" "this" {
      - bucket           = "notification-canada-ca-staging-system-status" -> null
      - id               = "notification-canada-ca-staging-system-status" -> null
      - website_domain   = "s3-website.ca-central-1.amazonaws.com" -> null
      - website_endpoint = "notification-canada-ca-staging-system-status.s3-website.ca-central-1.amazonaws.com" -> null

      - error_document {
          - key = "error.html" -> null
        }

      - index_document {
          - suffix = "index.html" -> null
        }
    }

  # module.system_status_static_site.random_string.suffix will be destroyed
  # (because module.system_status_static_site is not in configuration)
  - resource "random_string" "suffix" {
      - id          = "vbcwf3ri" -> null
      - length      = 8 -> null
      - lower       = true -> null
      - min_lower   = 0 -> null
      - min_numeric = 0 -> null
      - min_special = 0 -> null
      - min_upper   = 0 -> null
      - number      = true -> null
      - numeric     = true -> null
      - result      = "vbcwf3ri" -> null
      - special     = false -> null
      - upper       = false -> null
    }

Plan: 3 to add, 0 to change, 11 to destroy.

Changes to Outputs:
  ~ system_status_static_site_bucket_id     = "notification-canada-ca-staging-system-status" -> ""
  ~ system_status_static_site_bucket_name   = "arn:aws:s3:::notification-canada-ca-staging-system-status" -> ""
  ~ system_status_static_site_bucket_region = "ca-central-1" -> ""

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: plan.tfplan

To perform exactly these actions, run the following command to apply:
    terraform apply "plan.tfplan"

```

</details>

